Revit 2024 API
Domain Enumeration
 Type of connector domain.
 Enumeration of connector domain types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum Domain
Visual Basic
Public Enumeration Domain
Visual C++
public enum class Domain
Members
Member name | Description
DomainUndefined |  Domain is undefined
DomainHvac |  HVAC (duct) connector
DomainElectrical |  Electrical connector
DomainPiping |  Connector of cable trays or conduits
DomainCableTrayConduit |  Connector of Structural Analytical Model
See Also
Autodesk.Revit.DB Namespace